app/controllers/goods_controller.rb

  def index
    @Goods =  @company.goods.order(created_at: :desc)
---
SELECT "goods".* FROM "goods" ORDER BY "goods"."created_at" DESC