app/controllers/home_controller.rb

  def index
    @company = Company.find(params[:id]=1)

    @posters = Poster.all.order(rank: :desc)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT "posters".* FROM "posters" ORDER BY "posters"."rank" DESC