app/controllers/offers_controller.rb

SELECT "offers".* FROM "offers" ORDER BY "offers"."created_at" DESC
---
  def index
    @Offers = @company.offers.order(created_at: :desc)